# 模拟斗地主发牌
# 花色:
#     黑桃("\u2660"),梅花("\u2663"),红桃("\u2665"),方块("\u2666")
# 数字:
    # A2-10JQK
    # 大王
# 三个人,每个人发17张牌,底牌留三张
# 输入回车,打印第一个人的17张牌
# 输入回车,打印第二个人的17张牌
# 输入回车,打印第三个人的17张牌
# 输入回车,打印3张底牌

# 导入模块
import random as R

# 创建函数,通过两层循环制作整付卡牌,并随机打乱顺序
def card_all():
    l=["大王","小王"]
    for x in ["A","2","3","4","5","6","7","8","9","10","J","Q","K"]:
        # ["A"]+[str(x) for x in range(2,11)]+list("JQK")
        for y in ["\u2660","\u2663","\u2665","\u2666"]:
            z = x + y
            l.append(z)
    R.shuffle(l,R.random)
    return l

# 主程序开始按照切片发牌
def main():
    L=card_all()
    L1=L[0:17]
    L2=L[17:34]
    L3=L[34:51]
    L4=L[51:54]
    input("请输入回车键发牌:")
    print("第一个人的牌为:",L1)
    input("请输入回车键发牌:")
    print("第二个人的牌为:",L2)
    input("请输入回车键发牌:")
    print("第三个人的牌为:",L3)
    input("请输入回车键查看底牌:")
    print("底牌为:",L4)
main()